#17 вариант
arr = [3, 7, 12, 5, 9, 15, 2, 11]  
a, b = 5, 12   

print("Индексы элементов в диапазоне (a;b):")
for i, val in enumerate(arr):
    if a < val < b:   
        print(i, "->", val)
A = [
    [1, 2, 3, 4],
    [5, 6, 7, 8],
    [9, 10, 11, 12],
    [13, 14, 15, 16]
]

# побочная диагональ (элементы A[i][n-1-i])
n = 4
diag = [A[i][n-1-i] for i in range(n)]
print("\nЭлементы побочной диагонали:", diag)

avg = sum(diag) / len(diag)
print("Среднее арифметическое побочной диагонали:", avg)
